In [175]:
import pandas as pd 
import numpy as np


df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [176]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## Question 1:

In [177]:
init = 10045
for i,x in df['FlightNumber'].iteritems():
    x = init
    init += 10
    df['FlightNumber'].iloc[i] = int(x)

/Users/dipaktewari/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

## Converting float into int

In [178]:
df['FlightNumber'] = df['FlightNumber'].astype('int64')
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [179]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [180]:
df.shape[0]

5

## Creating tempdf to stor the from and to

In [181]:
tempdf = pd.DataFrame(columns = ['From','To'], index=range(df.shape[0]))
tempdf

  From   To
0  NaN  NaN
1  NaN  NaN
2  NaN  NaN
3  NaN  NaN
4  NaN  NaN

In [182]:
tempdf.dtypes

From    object
To      object
dtype: object

## Question 2

## Splitting and storing the values of from to into tempdf

In [183]:
for i,x in df['From_To'].iteritems():
    print(x.split('_'))
    to_from = x.split('_')
    tempdf['From'].iloc[i] = to_from[0]
    tempdf['To'].iloc[i] = to_from[1]

['LoNDon', 'paris']
['MAdrid', 'miLAN']
['londON', 'StockhOlm']
['Budapest', 'PaRis']
['Brussels', 'londOn']

In [184]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [185]:
tempdf

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## Question 3

## Converting values in form LoNDon to London

In [186]:
tempdf['To'] = tempdf['To'].str.title()
tempdf['From'] = tempdf['From'].str.title()

In [187]:
tempdf

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## Question 4

## Concatinating the tempdf into df

In [188]:
df = pd.concat([df,tempdf],axis=1)
df.drop(columns='From_To', inplace=True)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

## Question 5

In [189]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

## Converting the values in the recentdelays column to str from list

In [190]:
for i,l in df['RecentDelays'].iteritems():
    df['RecentDelays'].iloc[i] = ' '.join(str(e) for e in l)

/Users/dipaktewari/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [191]:
df

   FlightNumber RecentDelays              Airline      From         To
0         10045        23 47               KLM(!)    London      Paris
1         10055                 <Air France> (12)    Madrid      Milan
2         10065     24 43 87  (British Airways. )    London  Stockholm
3         10075           13       12. Air France  Budapest      Paris
4         10085        67 32          "Swiss Air"  Brussels     London

## Splitting the recentdelays column into 3 columns

In [192]:
df[['delay_1','delay_2','delay_3']] = df['RecentDelays'].str.split(' ', expand=True)

In [193]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,23 47,KLM(!),London,Paris,23,47,None
1,10055,,<Air France> (12),Madrid,Milan,,None,None
2,10065,24 43 87,(British Airways. ),London,Stockholm,24,43,87
3,10075,13,12. Air France,Budapest,Paris,13,None,None
4,10085,67 32,"""Swiss Air""",Brussels,London,67,32,None

In [194]:
df.drop(columns='RecentDelays', inplace=True)
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23,47,None
1,10055,<Air France> (12),Madrid,Milan,,None,None
2,10065,(British Airways. ),London,Stockholm,24,43,87
3,10075,12. Air France,Budapest,Paris,13,None,None
4,10085,"""Swiss Air""",Brussels,London,67,32,None